---
kind: property
id: P:Autodesk.Revit.DB.Architecture.ContinuousRailType.EndOrTopExtensionStyle
source: html/b01679f2-5998-9df8-c2e2-f9d39e5d9c36.htm
---
# Autodesk.Revit.DB.Architecture.ContinuousRailType.EndOrTopExtensionStyle Property

The extension style of the rail termination at the end or top.

## Syntax (C#)
```csharp
public RailExtensionStyle EndOrTopExtensionStyle { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration